ananawaretrk/Opal_Fcc_nrf52810/fcc_opal_1/main.cpp
/*
Firmware: Opal_fcc_v1.0
*/
#include <stdbool.h>
#include <stdint.h>
#include <stdlib.h>
#include <stdio.h>

#include "nfc_t2t_lib.h"
#include "nordic_common.h"
#include "nrf.h"
#include "app_uart.h"
#include "app_fifo.h"
#include "nrf_error.h"
#include "nrfx_twim.h"
#include "nrf_drv_spi.h"
#include "nrfx_rtc.h"
#include "nrf_drv_clock.h"
#include "nrf_drv_timer.h"
#include "nrf_pwr_mgmt.h"
#include "nrfx_gpiote.h"
#include "nrf_gpio.h"
#include "nrf_soc.h"
#include "app_timer.h"
#include "fds.h"
#include "ble.h"
#include "nrf_sdm.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"
#include "ble_advdata.h"
#include "ble_nus.h"
#include "ble_conn_params.h"
#include "ble_conn_state.h"
#include "ble_conn_params.h"
#include "nrf_ble_qwr.h"
#include "nrf_ble_gatt.h"
#include "ble_advertising.h"
#include "peer_manager.h"
#include "nrfx_gpiote.h"
#include "nrf_drv_gpiote.h"
#include "nrf_delay.h"
#include "nrf_nvmc.h"
#include "nrf_uarte.h"
#include "arm_const_structs.h"
#include "RH_SX126x.h"
#include "RH_RF95.h"
#include "Wire.h"
#include "TMP117.h"
#include "i2c_wrapper.h"
#include "eventflag_and_errors.h"
#include "boards.h"
#include "4gSIM.h"
#include "nrf_drv_wdt.h"
//#define temperature_sensor
#include "Dps310.h"
#include "TCA9535.h"
#include "LIS3DH.h"

// States
typedef enum {
  STATE_SOC_INIT,
  STATE_BOARD_INIT,
  STATE_GATT_SERVER,
  STATE_SLEEP,
  STATE_BLE_CONT_CW_TX,
  STATE_BLE_CONT_MCW_TX,
  STATE_BLE_CONT_RX,
  STATE_BLE_INT_CW_TX,
  STATE_BLE_INT_MCW_TX,
  STATE_BLE_INT_RX,
  STATE_BLE_INT_CW_TX_RX,
  STATE_BLE_INT_MCW_TX_RX,
  STATE_LTE_CONT_CW_TX,
  STATE_LTE_CONT_MCW_TX,
  STATE_LTE_CONT_RX,
  STATE_LTE_INT_CW_TX,
  STATE_LTE_INT_MCW_TX,
  STATE_LTE_INT_RX,
  STATE_ACCELERATION_AIRPLANE_MODE,
  STATE_PRESSURE_AIRPLANE_MODE,
  STATE_MODEM_NETWORK_CONFIG,
  STATE_DEBUG
} sm_state;

sm_state state = STATE_SOC_INIT;
// -- States 
#define MAX_CONSECUTIVE_READINGS 6
Dps310 dps_pressure_sensor = Dps310();
int y1 = -85.95;  // Land lower limit meters
int y2 = 1676.4; // Land upper limit meters
int x1 = 3048;  // Take-off lower limit meters
int x2 = 15240;  // Take-off upper limit meters
//int x1 = -50;  // Take-off lower limit meters
//int x2 = 20; // Take-off lower limit meters
//int y1 = -25;  // Land lower limit meters
//int y2 = 1;  // Land upper limit meters
int consecutive_x = 0;
int consecutive_y = 0;
double altitude = 0;
double seaLevelhPa = 1013.25; //hPa
int current_pressure = 0;
bool pressure_airplane_flag = false; 

TMP117  tmp_sensor = TMP117();
LIS3DH lis3dh_accel = LIS3DH();

bool acc_flag = false;
volatile int sustain_count = 0; 

// HALL effect
#define HALL_INT 17
APP_TIMER_DEF(timer_id_8); 
volatile bool hallTimer = false;
volatile uint8_t hallCounter = 0;
#define HALL_DFU_THRESHOLD 10
uint8_t hallState = 0;
// -- HALL effect

//UART COLOR DEFINE
#define DBG_RED     "\x1b[31m"
#define DBG_GREEN   "\x1b[32m"
#define DBG_YELLOW  "\x1b[33m"
#define DBG_BLUE    "\x1b[34m"
#define DBG_MAGENTA "\x1b[35m"
#define DBG_CYAN    "\x1b[36m"
#define DBG_BKG_CYAN "\x1b[46m"
#define DBG_RESET   "\x1b[0m"
//#define test_print

// Murata pins Sensor defines
#define MBN_INT                  20 // TCA EXP interrupt
#define I2C_SCL                  7 // Onyx i2c scl 7
#define I2C_SDA                  8 // Onyx i2c scl 8
#define I2C_PRIORITY             2
I2CWrapper i2c_wrapper(I2C_SDA,I2C_SCL,I2C_PRIORITY);
TwoWire Wire(i2c_wrapper.GetI2CInstance());
void print_temperature_sensor_data(void);

//Modem
static nbiot nbiot_instance;
//#define CELL_ENABLE_PIN_O        NRF_GPIO_PIN_MAP(1, 6)
//#define CELL_TX                  NRF_GPIO_PIN_MAP(0, 26)
//#define CELL_RX                  NRF_GPIO_PIN_MAP(0, 27)


// For Onyx 2.8
//#define CELL_ENABLE_PIN_O        29
//#define CELL_TX                  15
//#define CELL_RX                  16
#define GPS_BK_EN                13 // Not used in opal

volatile int cell_timer_flag           = 0;

// For Opal V1.1.0
#define CELL_ENABLE_PIN_O     2
#define CELL_TX               6
#define CELL_RX               7
#define OPAL_LED              25
#define SENSOR_EN             5
#define LIS3_INT              24 // lis3dh Interrupt pin

// tca
#define TCA_GPS_STNDBY_PIN_O     0
#define TCA_GPS_RST_PIN_O        1
#define TCA_HDCINT_PIN_I         2
#define TCA_LED_PIN_O            3
#define TCA_OPT_INT_I            4
#define TCA_GPS_EN_PIN_O         5
#define TCA_DPSINT_PIN_I         6
#define TCA_IOX_O                7
#define TCA_LIS_INT2_I          10
#define TCA_UNUSED_P11          11
#define TCA_LED_PIN_O2          12
#define TCA_MCP_OCAL            15 
#define TCA_MCP_SCAL            16
#define TCA_BATT_ENABLE_PIN_O   13 // Switch to enable battery voltage monitor
#define TCA_LED_PIN_O1          14 // LED - TCA PIN 
#define TCA_MCP_EN2_O           17 // Alternate path to MCPEN if MCP_PWR_EN is not decided to be used
volatile bool tca_interrupt_detected    = false;
TCA9535 TCA = TCA9535();
void TCAInitialize();
void TCATest();
// --tca

// Watchdog
#define WATCHDOG_TIMEOUT_MS 600000 // 10 minutes in milliseconds


// LoRa defines
RH_RF95 rf95 = RH_RF95();

#define SPI_MISO_PIN    5
#define SPI_MOSI_PIN    3
#define SPI_SCK_PIN     4
#define LORA_NSS        2
#define LORA_RST        17
#define LORA_INT        6

uint8_t  buff[RH_RF95_MAX_MESSAGE_LEN];
char loraSendBuf[RH_RF95_MAX_MESSAGE_LEN];

// LoRa Function Prototypes
bool loraInit();
void init_spi_for_lora();
void lora_continuous_cw_transmit();
void lora_cw_transmit_5seconds();
void lora_continuous_transmit();
void lora_continuous_receive();
void lora_interval_transmit(int localadvTime);
void lora_interval_transmit1(int localadvTime);
void lora_interval_receive(int scanDuration);
void lora_disable();

// Utility Function Prototypes
long power_map(long x, long in_min, long in_max, long out_min, long out_max);
long input_min = 0;
long input_max = 8;
long output_min = 5;
long output_max = 20;
int8_t loratxlevel = 0;
float lorafrequency = 915.0f;

int8_t cellpowerlevel = 0;
long cell_input_min = 0;
long cell_input_max = 8;
long cell_output_min = -50;
long cell_output_max = 23;

int8_t cellrxpowerlevel = 0;
long cellrx_input_min = 0;
long cellrx_input_max = 8;
long cellrx_output_min = -127;
long cellrx_output_max = -25;

void cell_interval_receive(int rcv_time);
void cell_interval_receive_modulated(int rcv_time);



