ananawaretrk/Opal_Fcc_nrf52810/fcc_opal_1/main.cpp
#define UD_SER
#define CUT
#define PAR_CONFIG
//#define RESET
#define SAS //Scan,Adv,Sleep
//#define SLEEP

#define CLOCK_RESOULATION__ms     (1)

APP_TIMER_DEF(timer_id); //create a timer id
APP_TIMER_DEF(clock_id);
APP_TIMER_DEF(cell_timer_id); // use only for cellular operations

uint32_t millis_counter = 0;

void init_timer2(void);
void timer2_event_handler(void* p_context);

//#define LORA_INT        9
//#define LORA_RST        10
//#define LORA_NSS        4
//#define SPI_SCK_PIN     5
//#define SPI_MISO_PIN    11
//#define SPI_MOSI_PIN    NRF_GPIO_PIN_MAP(1,9)
#define ADXL375_SS_PIN  28
#define KX134_SS_PIN    2
#define SENSOR_PWR_PIN  3

#define SPI_INSTANCE  0
static const nrf_drv_spi_t spi = NRF_DRV_SPI_INSTANCE(SPI_INSTANCE);
volatile bool spi_xfer_done;
void spi_event_handler(nrf_drv_spi_evt_t const *p_event, void *p_context);

uint8_t lora_selected   = 0;
int8_t  lora_power      = 14;
float   lora_frequency  = 915.0f;

//Modem
uint8_t celltxrx = 0;

void lora_radio_enable(void);
void lora_radio_configure(void);
void lora_radio_cw_mode_w_data(void);
void lora_radio_cw_rx_mode(void);
void lora_radio_cw_mode(void);
void lora_radio_disable(void);

RH_SX126x sx126x = RH_SX126x();

void gpiote_lora_evt_handler(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t action);

//Set this to 1 for scanner/advertise relay, 0 is normal cellular upload
#define ADV_SCANNER_FW 0
//Set this to 1 to disable TCA9535 code for green tape
#define TINY_RELAY 0

static char ackMessage[2] = "A";

//BLE SCANNING
int ADV_W = 250;     // uint millisecond
int8_t txlevel = 7;
int TX_POWER[9] = {-40,-30,-20,-16,-12,-8,-4,0,4};

uint8_t Ble_Scn_SIG[2] = {0x59, 0x00};
uint8_t Ble_Scn_SIG_ext[2] = {0x59, 0x00};
uint8_t Ble_Scn_Tab[2] = {0x0D, 0x18};
uint8_t Ble_Scn_UUID[2] = {0x49, 0x54}; // hex of IT(Infrastructure Tape)
uint8_t Ble_Scn_UUID_DEL[2] = {0xDE, 0x1E}; // hex of IT(Infrastructure Tape)
uint8_t Ble_Scn_OTA[2] = {0xDF, 0x00};
uint8_t Ble_Scn_UUID_out[2] = {0xCA, 0xF0};

enum EIR
{
    L0,
    T0,
    V0,
    L1,
    T1,
    SIGH,
    SIGL,
    U0,
    U1,
    U2,
    U3,
    U4,
    U5,
    U6,
    U7,
    U8,
    U9,
    U10,
    U11,
    U12,
    U13,
    U14,
    U15,
}; // BLE EIR Enum

bool clearFlag = true;
uint8_t records = 0;
bool TapeConfig = true;
bool BLE_GW = false;
bool Drop_Flag = false;
bool B_gps = false;
bool B_lora = false;
bool B_cell = false;
bool Tape_Type = false;
uint8_t Accl_TH = 1;
bool connected;
float hrsbuff[20];
bool cut_flag = false;
bool reset_flag = false;
bool debugMode = false;
bool findtapeFlag = false;

#ifdef UD_SER
#define APP_BLE_CONN_CFG_TAG             1                                          /**< A tag identifying the SoftDevice BLE configuration. */
#define DEVICE_NAME                      "CONFIG_DUT"                               /**< Name of device. Will be included in the advertising data. */
#define NUS_SERVICE_UUID_TYPE            BLE_UUID_TYPE_VENDOR_BEGIN                 /**< UUID type for the Nordic UART Service (vendor specific). */
#define APP_BLE_OBSERVER_PRIO            3                                          /**< Application's BLE observer priority. You shouldn't need to modify this value. */
#define APP_ADV_INTERVAL                 64                                         /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */
#define APP_ADV_DURATION                 18000                                      /**< The advertising duration (180 seconds) in units of 10 milliseconds. */
#define MIN_CONN_INTERVAL                MSEC_TO_UNITS(20, UNIT_1_25_MS)            /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL                MSEC_TO_UNITS(75, UNIT_1_25_MS)            /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                    0                                          /**< Slave latency. */
#define CONN_SUP_TIMEOUT                 MSEC_TO_UNITS(4000, UNIT_10_MS)            /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(5000)                      /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY    APP_TIMER_TICKS(30000)                     /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT     3                                          /**< Number of attempts before giving up the connection parameter negotiation. */
#define DEAD_BEEF                        0xDEADBEEF                                 /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */
#define UART_TX_BUF_SIZE                 256                                        /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE                 256                                        /**< UART RX buffer size. */
BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);                                   /**< BLE NUS service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */
static uint16_t     m_conn_handle          = BLE_CONN_HANDLE_INVALID;               /**< Handle of the current connection. */
static uint16_t     m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;          /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */

static ble_uuid_t m_adv_uuids[]            =                                        /**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};
#endif //UD_SER

#define APP_BLE_OBSERVER_PRIO 3                                                     //Application's BLE observer priority. You shouldn't need to modify this value.

