ananawaretrk/Opal_Fcc_nrf52810/fcc_opal_1/main.cpp
bool oxy_scanned = false;
bool low_voltage = false;
#define RADIO_LENGTH_LENGTH_FIELD     (8UL) /**< Length on air of the LENGTH field. */
#define RADIO_MAX_PAYLOAD_LEN         256     /**< Maximum radio RX or TX payload. */
uint8_t m_tx_packet[RADIO_MAX_PAYLOAD_LEN];                                                                             /**< Buffer for the radio TX packet. */
uint8_t    mode                       = RADIO_MODE_MODE_Ble_2Mbit;    /**< Radio mode. Data rate and modulation. */
uint8_t    txpower                    = RADIO_TXPOWER_TXPOWER_0dBm; /**< Radio output power. */
uint32_t    channel                    = 40;
uint8_t g_rx_packet[RADIO_MAX_PAYLOAD_LEN];                                       /**< Buffer for the radio RX packet. */


void check_mode();
void mode_check();
void shutoffChecker();
void shutonChecker();

#define adcToBat(x) ((x * 0.6f / 1024.0f) * 2.0f * 6.0f)

//function prototypes
void ud_advertising_start(bool erase_bonds);
void application_timers_start(void);
void application_timers_stop(void);
void advertising_init(void);
void advertising_start(void);
void zeroTags(int tagy);
bool checkZeros(void);
void wdt_init(int seconds);
void wdt_reset();
void init_timer();
void start_timer(int miliTimeout);
void timer_event_handler(void *p_context);
void stop_timer();
void systemSleep();
void setupSensors();
void random_pwr_fix();
void callmainwithbyte(uint8_t byte);
void get_ble_mac(void);
int checkIdInLog(uint8_t inArray[], int testlog);
int compareArrays(uint8_t a[], uint8_t b[], int n);
bool uploadData();
void bleScan(int timeOutMillis);
void bleAdv(int timeOutMillis);
void wakeFromSleep();
void goToSleep();
void goToSleepAirSense();
void createTimeString();
void shutoffChecker();
void clearBit(int n);
int checkBit(int n);
void setBit(int n);
void setVerBits(int V);
void batteryCheck();

uint8_t *hex_decode(char *in, size_t len, uint8_t *out);
void prepare_sleep();
void prepare_wake();
void radio_disable(void);
void radio_config();
void sel_txpower(int tx_level);
void radio_with_data(bool flag);
void modulation(void);
void tapeDiagnosis(void);
void radio_rx(void);


uint32_t millis(void)
{
    return millis_counter;
}

void timer2_event_handler(void* p_context)
{
    (void)p_context;
    millis_counter++;
}

/**@brief Handler for shutdown preparation.
 */
bool shutdown_handler(nrf_pwr_mgmt_evt_t event)
{
    uint32_t err_code;

    switch (event)
    {
        case NRF_PWR_MGMT_EVT_PREPARE_SYSOFF:
            printf("NRF_PWR_MGMT_EVT_PREPARE_SYSOFF");
            break;

        case NRF_PWR_MGMT_EVT_PREPARE_WAKEUP:
            printf("NRF_PWR_MGMT_EVT_PREPARE_WAKEUP");
            break;

        case NRF_PWR_MGMT_EVT_PREPARE_DFU:
            printf("Entering DFU, you may have to fix this code");
            break;

        case NRF_PWR_MGMT_EVT_PREPARE_RESET:
            printf("NRF_PWR_MGMT_EVT_PREPARE_RESET");
            break;
    }

    err_code = app_timer_stop_all();
    APP_ERROR_CHECK(err_code);

    return true;
}
/**@brief Register application shutdown handler with priority 0. */
NRF_PWR_MGMT_HANDLER_REGISTER(shutdown_handler, 0);

void on_adv_report(ble_gap_evt_adv_report_t const *p_adv_report)
{
    volatile uint8_t i, j, k;
    int status = 0;
    adv_address = (uint8_t *)p_adv_report->peer_addr.addr;
    adv_data = (uint8_t *)p_adv_report->data.p_data;
    adv_len = (uint16_t)p_adv_report->data.len;
    //printf("\nFROM: %02x:%02x:%02x:%02x:%02x:%02x %d\n", adv_address[0], adv_address[1], adv_address[2], adv_address[3], adv_address[4], adv_address[5], p_adv_report->rssi);

    if(!debugMode)
    {
        if (adv_data[SIGH] == Ble_Scn_SIG_ext[0] && adv_data[SIGL] == Ble_Scn_SIG_ext[1])
        {
            if (adv_data[7] == Ble_Scn_UUID[0] && adv_data[8] == Ble_Scn_UUID[1] && adv_len == data_len)
            {
                status = -1;

                if (status == -1)
                {
                    clearFlag = false;
                    printf("\nFROM: %02x:%02x:%02x:%02x:%02x:%02x %d\n", adv_address[0], adv_address[1], adv_address[2], adv_address[3], adv_address[4], adv_address[5], p_adv_report->rssi);
                    //Copy Address
                    for (int i = 5; i >= 0; i--)
                    {
                        TapeLog[0].scanLog[records].addr[i] = adv_address[i];
                    }

                    setBit(records);
                    TapeLog[0].scanLog[records].rssi = adv_data[9];

                    printf("Rssi:%d\n",TapeLog[0].scanLog[records].rssi);
                    //Copy Battery
                    TapeLog[0].scanLog[records].subBat = (float)(adv_data[10]);;
                    printf("BATT:%f\n",TapeLog[0].scanLog[records].subBat);

                    records = (records + 1) % NUMBER_OF_TAGS;
                }
                else
                {
                    setBit(status);
                    for(int j=records; j<NUMBER_OF_TAGS;j++)
                    {
                        TapeLog[0].scanLog[j].counter = 0;
                    }
                }
            }
        }
    }
    else
    {
        if (adv_data[7] == Ble_Scn_UUID[0] && adv_data[8] == Ble_Scn_UUID[1])
        {
            if(checkIdInLog(adv_address, 0) == -1)
            {
                printf("\nFROM: %02x:%02x:%02x:%02x:%02x:%02x %d\n", adv_address[0], adv_address[1], adv_address[2], adv_address[3], adv_address[4], adv_address[5], p_adv_report->rssi);
                //Copy Address
                for (int i = 5; i >= 0; i--)
                    TapeLog[0].scanLog[records].addr[i] = adv_address[i];

                //Copy Rssi
                TapeLog[0].scanLog[records].rssi = p_adv_report->rssi;
                printf("Rssi:%d\n",TapeLog[0].scanLog[records].rssi);

                //Copy Battery
                TapeLog[0].scanLog[records].subBat = (float)(adv_data[10]);;
                printf("BATT:%f\n",TapeLog[0].scanLog[records].subBat);

                records = (records + 1) % NUMBER_OF_TAGS;

