ananawaretrk/Opal_Fcc_nrf52810/fcc_opal_1/main.cpp
void print_temperature_sensor_data()
{
    int temperature_fail_counter = 0;
    float temperature_array[5] = {0};

    //i2c_wrapper.InitializeI2C();
    tmp_sensor.begin();
    for (int j = 0; j < 5; j++)
    {
        temperature_fail_counter = 0;
        tmp_sensor.setOneShotMode();
        while (tmp_sensor.dataReady() == false && temperature_fail_counter < 5)
        {
            nrf_delay_ms(110);
            temperature_fail_counter++;
        }
        temperature_array[j] = tmp_sensor.readTempC();
    }
    tmp_sensor.setShutdownMode();
    printf("----> Final TMP117 Temp = %3.2f %C\n", temperature_array[0]);
    //i2c_wrapper.DeInitializeI2C();
}

// --Temperature Sensor

// Pressure Sensor
void print_pressure_sensor_data()
{
    int ret = -1;
    int temp_pressure_value    = -1;
    int temp_temp_value = -1;
    printf("Inside pressure sensor function\n");
    //i2c_wrapper.InitializeI2C();
    dps_pressure_sensor.begin(Wire, 0x76);
    while (1)
    {
        ret = dps_pressure_sensor.measurePressureOnce(current_pressure);
        //ret = dps_pressure_sensor.measureTempOnce(temp_temp_value);
        altitude = 44330.0 * (1 - pow((((double)current_pressure/100) / seaLevelhPa), 0.190294957));
        printf("DSP310 pressure = %d Pa (101325 kPa), Altitude: %.2f (meters)\n", current_pressure, altitude);
        nrf_delay_ms(500);
    }
    //i2c_wrapper.DeInitializeI2C();
}

sm_state pressure_airplane_mode()
{
    dps_pressure_sensor.begin(Wire, 0x76);

//    TCA.writePin(TCA_LED_PIN_O, TCA.ON);
//    TCA.writePin(TCA_LED_PIN_O2, TCA.ON);
//    pressure_airplane_flag = true;

    while(1)
    {
        dps_pressure_sensor.measurePressureOnce(current_pressure);

        altitude = 44330.0 * (1 - pow((((double)current_pressure/100) / seaLevelhPa), 0.190294957));

        printf("DSP310 pressure = %d Pa (101325 kPa), Altitude: %.2f (meters), consecutive_x: %d\n", current_pressure, altitude, consecutive_x);

        if(altitude >= x1 && altitude <=x2){
            consecutive_x++;
        }
        else{
            consecutive_x = 0;
        }

        if(altitude >= y1 && altitude <= y2){
            consecutive_y++;
        }
        else{
            consecutive_y = 0;
        }
        
        
        if(consecutive_x == MAX_CONSECUTIVE_READINGS){
            pressure_airplane_flag = true;
        }

        if(consecutive_y == MAX_CONSECUTIVE_READINGS){
            pressure_airplane_flag = false;
        }
        
        if(pressure_airplane_flag)
        {
            TCA.writePin(TCA_LED_PIN_O, TCA.ON);
            TCA.writePin(TCA_LED_PIN_O2, TCA.ON);
        }
        else
        {
            TCA.writePin(TCA_LED_PIN_O, TCA.OFF);
            TCA.writePin(TCA_LED_PIN_O2, TCA.OFF);
        }
        

        nrf_delay_ms(10000);

    }

    return STATE_SLEEP;
}
// --Pressure Sensor


static void Lis3EvtHandler(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    printf("---------> Motion Interrupt TRIGGERED\n");
}

long power_map(long x, long in_min, long in_max, long out_min, long out_max) {
  return (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}

void CellTimerEventHandler(void *p_context) {
  cell_timer_flag = 1;
}

void StopCellTimer() {
  app_timer_stop(cell_timer_id);
}

void StartCellTimer(uint32_t mili_sec_timeout) {
  //printf("----------------- Starting Cell Timer ------------------\n");
  uint32_t error_code = 0;
  StopCellTimer();
  app_timer_create(&cell_timer_id, APP_TIMER_MODE_SINGLE_SHOT, CellTimerEventHandler);
  error_code = app_timer_start(cell_timer_id, APP_TIMER_TICKS(mili_sec_timeout), NULL);
  cell_timer_flag = 0;
}

void init_Modem()
{
  printf(DBG_BKG_CYAN "Initializing modem\n" DBG_RESET);
  nbiot_instance.Init(CELL_RX, CELL_TX,StartCellTimer,&cell_timer_flag);
  nrf_delay_ms(2000);
  nbiot_instance.GetConfig();
}

sm_state modem_network_config()
{
    nrf_gpio_pin_set(CELL_ENABLE_PIN_O);
    nrf_delay_ms(2000);
    init_Modem();
    //nbiot_instance.SetConfig(false); // LTE-M or NB-IOT no preference
    nbiot_instance.SetConfig(true); // NB-IOT Only
    nbiot_instance.GetConfig();
    while(1)
    {
        nbiot_instance.CheckConnection();
        nrf_delay_ms(1000);
    }
    return STATE_SLEEP;
}

void cell_interval_receive(int rcv_time)
{
    
    printf(DBG_MAGENTA "cell Interval Receive\n" DBG_RESET);

    start_timer(rcv_time);
    nbiot_instance.CwFunction(0, 1, channel, cellrxpowerlevel, false);
    while (!timerFlag)
    {
      nrf_pwr_mgmt_run();
    }
    stop_timer();

    nbiot_instance.CwFunction(0, 0, channel, cellrxpowerlevel, false);
}

void cell_interval_receive_modulated(int rcv_time)
{
    
    printf(DBG_MAGENTA "cell Interval Receive\n" DBG_RESET);

    start_timer(rcv_time);
    nbiot_instance.CwFunction(0, 1, channel, cellpowerlevel, true);
    while (!timerFlag)
    {
      nrf_pwr_mgmt_run();
    }
    stop_timer();

    nbiot_instance.CwFunction(0, 0, channel, cellpowerlevel, true);
}

void stop_hall_effect_timer() {
   printf("Stopping hall effect timer\n");
   app_timer_stop(timer_id_8);
   hallTimer = false;
}

void hall_effect_timer_event_handler(void * p_context)
{
    printf("Hall effect timer event handler\n");
    if(hallCounter < HALL_DFU_THRESHOLD){
    printf("Not enough swipes\n");
    hallCounter = 0;
    }
    stop_hall_effect_timer();
}

void start_hall_effect_timer(uint32_t milliseconds) {
  ret_code_t error_code;

  stop_hall_effect_timer();
  printf("Starting hall effect timer for %d milliseconds\n", milliseconds);
  
  error_code = app_timer_create(&timer_id_8, APP_TIMER_MODE_SINGLE_SHOT, hall_effect_timer_event_handler);
  if (error_code != NRF_SUCCESS) {
    printf("app_timer_create for hall effect timer failed: %d\n", error_code);
  }

  hallTimer = true;

  error_code = app_timer_start(timer_id_8, APP_TIMER_TICKS(milliseconds), NULL);
  if (error_code != NRF_SUCCESS) {
    printf("app_timer_start for hall effect timer failed: %d\n", error_code);
  }
}

void hall_gpio_init() {
  nrf_gpio_cfg_input(HALL_INT ,NRF_GPIO_PIN_NOPULL);
}
void gpiote_hall_evt_handler(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t action) {
printf("hall triggered\n");
hallCounter++;
if(hallTimer == false){
    start_hall_effect_timer(8000);
  }
 if(hallCounter >= 10){
 //NRF_POWER->GPREGRET = 0xB1;
 NVIC_SystemReset();
 }
}
void config_hall_sensor() {
  nrfx_gpiote_in_config_t hall_config;
  hall_config.is_watcher = false;
  hall_config.hi_accuracy = false;
  hall_config.skip_gpio_setup = false;
  hall_config.sense = NRF_GPIOTE_POLARITY_TOGGLE;
  hall_config.hi_accuracy = true;
  hall_config.pull = NRF_GPIO_PIN_NOPULL;
  if (nrfx_gpiote_in_init(HALL_INT, &hall_config, gpiote_hall_evt_handler) != NRFX_SUCCESS) {
    printf("nrfx_gpiote_in_init failed for hall effect sensor\n");
  }
  nrfx_gpiote_in_event_enable(HALL_INT, true);
}
sm_state soc_init()
{
    ret_code_t err_code;

    config_init();
    get_ble_mac();
    get_hw_ver();
    init_timer();
    init_timer2();

