ananawaretrk/Opal_Fcc_nrf52810/fcc_opal_1/main.cpp
    sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);

    if (nrfx_gpiote_init() != NRFX_SUCCESS){
    printf("!!!WARN: NRF gpiote failed to initialize\n");
    }
    nrf_delay_ms(100);

    return STATE_BOARD_INIT;
}
sm_state board_init()
{
    //    hall_gpio_init();
    //    config_hall_sensor();
    //
    //    // Turn OFF MODEM
    //    nrf_gpio_cfg_output(CELL_ENABLE_PIN_O);
    //    nrf_gpio_pin_clear(CELL_ENABLE_PIN_O);
    //    nrf_delay_ms(1000);
    //
    //    nrf_gpio_cfg_output(SENSOR_EN);
    //    nrf_delay_ms(500);
    //    //nrf_gpio_pin_clear(SENSOR_EN);
    //    nrf_gpio_pin_set(SENSOR_EN);
    //
    //    nrf_gpio_cfg_output(GPS_BK_EN);
    //    nrf_delay_ms(500);
    //    nrf_gpio_pin_clear(GPS_BK_EN);
    //
    //    nrf_gpio_cfg_input(MBN_INT, NRF_GPIO_PIN_NOPULL);
    //
    //     i2c_wrapper.InitializeI2C();
    //     TCAInitialize();
    //     TCATest();
    // i2c_wrapper.DeInitializeI2C();

    nrf_gpio_cfg_output(CELL_ENABLE_PIN_O);
    nrf_gpio_pin_clear(CELL_ENABLE_PIN_O);
    nrf_delay_ms(1000);

    // LED
    nrf_gpio_cfg_output(OPAL_LED);
    for (int i = 0; i < 10; i++)
    {
        nrf_gpio_pin_clear(OPAL_LED);
        nrf_delay_ms(200);
        nrf_gpio_pin_set(OPAL_LED);
        nrf_delay_ms(200);
    }

     return STATE_GATT_SERVER;
    // return STATE_DEBUG;
    // return STATE_SLEEP;
    // return STATE_ACCELERATION_AIRPLANE_MODE;
    // return STATE_PRESSURE_AIRPLANE_MODE;
    // return STATE_MODEM_NETWORK_CONFIG;
}

void ble_radio_setup()
{   
    // Disable SD
    nrf_sdh_disable_request();

    // Configure HFCLK
    NRF_RNG->TASKS_START = 1;
    NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;
    NRF_CLOCK->TASKS_HFCLKSTART        = 1;
    while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0){ } // Do nothing.

    // Disable Radio
    NRF_RADIO->SHORTS = 0;
    NRF_RADIO->EVENTS_DISABLED = 0;
    NRF_RADIO->TASKS_TXEN = 0;
    NRF_RADIO->TASKS_STOP = 1;
    NRF_RADIO->TASKS_DISABLE = 1;
    NRF_RADIO->EVENTS_END = 1U;

    while (NRF_RADIO->EVENTS_DISABLED == 0){  }    // Do nothing.

    NRF_RADIO->EVENTS_DISABLED = 0;
}

sm_state start_gatt_server()
{
    setConfig(120000);

    if(celltxrx != 0){
    nrf_gpio_pin_set(CELL_ENABLE_PIN_O);
    nrf_delay_ms(2000);
    init_Modem();
    }
    
    //STATE_BLE_CONT_CW_TX
    if(MODE == 2 && celltxrx == 0 && advTime == 0 && scanDuration == 0 && sleepTime == 0){
    return STATE_BLE_CONT_CW_TX;
    }

    else if(MODE == 0 && celltxrx == 0 && advTime == 0 && scanDuration == 0 && sleepTime == 0){
    return STATE_SLEEP;
    }
    
    //STATE_BLE_CONT_MCW_TX
    else if(MODE == 3 && celltxrx == 0 && advTime == 0 && scanDuration == 0 && sleepTime == 0){
    return STATE_BLE_CONT_MCW_TX;
    }

    //STATE_BLE_CONT_RX
    else if(MODE == 2 && celltxrx == 0 && advTime == 0 && scanDuration > 0 && sleepTime == 0){
    return STATE_BLE_CONT_RX;
    }

    //STATE_BLE_INT_CW_TX
    else if(MODE == 2 && celltxrx == 0 && advTime > 0 && scanDuration == 0 && sleepTime > 0){
    return STATE_BLE_INT_CW_TX;
    }
    
    //STATE_BLE_INT_MCW_TX
    else if(MODE == 3 && celltxrx == 0 && advTime > 0 && scanDuration == 0 && sleepTime > 0){
    return STATE_BLE_INT_MCW_TX;
    }

    //STATE_BLE_INT_RX
    else if(MODE == 2 && celltxrx == 0 && advTime == 0 && scanDuration > 0 && sleepTime > 0){
    return STATE_BLE_INT_RX;
    }

    //--STATE_BLE_INT_CW_TX_RX
    else if(MODE == 2 && celltxrx == 0 && advTime > 0 && scanDuration > 0 && sleepTime > 0){
    return STATE_BLE_INT_CW_TX_RX;
    }

    //STATE_BLE_INT_MCW_TX_RX
    else if(MODE == 3 && celltxrx == 0 && advTime > 0 && scanDuration > 0 && sleepTime > 0){
    return STATE_BLE_INT_MCW_TX_RX;
    }

    //STATE_LTE_CONT_CW_TX
    else if(MODE == 2 && celltxrx == 1 && advTime == 0 && scanDuration == 0 && sleepTime == 0){
    return STATE_LTE_CONT_CW_TX;
    }

    //STATE_LTE_CONT_MCW_TX
    else if(MODE == 3 && celltxrx == 1 && advTime == 0 && scanDuration == 0 && sleepTime == 0){
    return STATE_LTE_CONT_MCW_TX;
    }

    //STATE_LTE_CONT_RX
    else if(MODE == 2 && celltxrx == 2 && advTime == 0 && scanDuration == 0 && sleepTime == 0){
    return STATE_LTE_CONT_RX;
    }

    //STATE_LTE_INT_CW_TX
    else if(MODE == 2 && celltxrx == 1 && advTime > 0 && scanDuration == 0 && sleepTime > 0){
    return STATE_LTE_INT_CW_TX;
    }

    //STATE_LTE_INT_MCW_TX
    else if(MODE == 3 && celltxrx == 1 && advTime > 0 && scanDuration == 0 && sleepTime > 0){
    return STATE_LTE_INT_MCW_TX;
    }

    //STATE_LTE_INT_RX
    else if(MODE == 2 && celltxrx == 2 && advTime == 0 && scanDuration > 0 && sleepTime > 0){
    return STATE_LTE_INT_RX;
    }
    
    //Default
    return STATE_SLEEP;
}
sm_state ble_cont_cw_tx()
{
  // Configure BLE Radio
  ble_radio_setup();

  // Run CW 
  radio_config();

  return STATE_SLEEP;
}
sm_state ble_cont_mcw_tx()
{
  // Configure BLE Radio
  ble_radio_setup();
  
  //Run Modulated CW
  modulation();

  return STATE_SLEEP;
}
sm_state ble_cont_rx()
{
  bleScan(scanDuration);

  return STATE_BLE_CONT_RX;
}

sm_state ble_int_cw_tx()
{
    // Setup BLE Radio
    ble_radio_setup();

    while (1)
    {
        // Run CW
        radio_config();

        // Advertise for x seconds
        start_timer(advTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        // Stop CW
        radio_disable();

        // Do not advertise for x seconds
        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();
    }

    return STATE_SLEEP;
}
sm_state ble_int_mcw_tx()
{
    // Setup BLE Radio
    ble_radio_setup();

    while (1)
    {
        // Run MCW
        modulation();

        // Advertise for x seconds
        start_timer(advTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        // Stop MCW
        radio_disable();

        // Do not advertise for x seconds
        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();
    }

    return STATE_SLEEP;
}
sm_state ble_int_rx()
{
    // Setup BLE Radio
    ble_radio_setup();

    while (1)
    {
        // Run scan for x seconds
        bleScan(scanDuration);

        // Do not scan and sleep for x seconds
        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();
    }

    return STATE_SLEEP;
}
sm_state ble_int_cw_tx_rx()
{
    // Setup BLE Radio
    ble_radio_setup();

    while (1)
    {
        // Run CW
        radio_config();

        // Advertise for x seconds
        start_timer(advTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        // Stop CW
        radio_disable();

        // Do not advertise for x seconds
        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

