ananawaretrk/Opal_Fcc_nrf52810/fcc_opal_1/main.cpp
        // Run scan for x seconds
        bleScan(scanDuration);
    }

    return STATE_SLEEP;
}
sm_state ble_int_mcw_tx_rx()
{
    // Setup BLE Radio
    ble_radio_setup();

    while (1)
    {
        // Run CW
        modulation();

        // Advertise for x seconds
        start_timer(advTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        // Stop CW
        radio_disable();

        // Do not advertise for x seconds
        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        // Run scan for x seconds
        bleScan(scanDuration);
    }

    return STATE_SLEEP;
}
sm_state lte_cont_cw_tx()
{
    nbiot_instance.CwFunction(1, 1, channel, cellpowerlevel, false);

    while (1)
    {
        nrf_pwr_mgmt_run();
    }
    
    return STATE_SLEEP;
}
sm_state lte_cont_mcw_tx()
{
    nbiot_instance.CwFunction(1, 1, channel, cellpowerlevel, true);

    while (1)
    {
        nrf_pwr_mgmt_run();
    }

    return STATE_SLEEP;
}
sm_state lte_cont_rx()
{
    nbiot_instance.CwFunction(0, 1, channel, cellrxpowerlevel, false);
    while (1)
    {
        nrf_pwr_mgmt_run();
    }
    
    return STATE_SLEEP;
}
sm_state lte_int_cw_tx()
{
    while (1)
    {
        nbiot_instance.CwFunction(1, 1, channel, cellpowerlevel, false);

        start_timer(advTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        nbiot_instance.CwFunction(1, 0, channel, cellpowerlevel, false);

        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();
    }

    return STATE_SLEEP;
}

sm_state lte_int_mcw_tx()
{
    while (1)
    {
        nbiot_instance.CwFunction(1, 1, channel, cellpowerlevel, true);

        start_timer(advTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        nbiot_instance.CwFunction(1, 0, channel, cellpowerlevel, true);

        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();
    }

    return STATE_SLEEP;
}
sm_state lte_int_rx()
{
    while (1)
    {
        nbiot_instance.CwFunction(0, 1, channel, cellpowerlevel, false);

        start_timer(advTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        nbiot_instance.CwFunction(0, 0, channel, cellpowerlevel, false);

        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();
    }

    return STATE_SLEEP;
}
sm_state acceleration_airplane_mode()
{
    if (lis3dh_accel.begin(0x19, 0x33))
    {
        printf("LIS3DH Init Success\n");
    }
    else
    {
        printf("LIS3DH not Initialized\n");
    }

    lis3dh_accel.setDataRate(LIS3DH_DATARATE_100_HZ);
    nrfx_gpiote_in_config_t config;
    config.is_watcher = false;
    config.hi_accuracy = false;
    config.skip_gpio_setup = false;
    config.pull = NRF_GPIO_PIN_NOPULL;
    config.sense = NRF_GPIOTE_POLARITY_LOTOHI;
    nrf_gpio_cfg_input(LIS3_INT, NRF_GPIO_PIN_NOPULL);

    if (nrfx_gpiote_in_init(LIS3_INT, &config, Lis3EvtHandler) != NRFX_SUCCESS)
    {
        printf("LIS3DH ACCEL INT init failed \n");
    }
    else
    {
        printf("LIS3DH ACCEL INT init succeeded %d\n", 1);
    }
    nrfx_gpiote_in_event_enable(LIS3_INT, true);
    lis3dh_accel.serviceReferenceInt();

    int fail_count = 3000;
    while (nrf_gpio_pin_input_get(LIS3_INT) && fail_count > 0)
    {
        nrf_delay_ms(10);
        fail_count--;
    }
    if (fail_count == 0)
    {
        printf("!!!WARN: LIS3DH Interrupt Error\n");
        SetErrorMask(ACC_ERROR_MASK);
    }

    //TCA.writePin(TCA_LED_PIN_O, TCA.ON);
    //TCA.writePin(TCA_LED_PIN_O2, TCA.ON);

    while (1)
    {
        lis3dh_accel.read();
        float temp_acc = abs(lis3dh_accel.x_g) + abs(lis3dh_accel.y_g) + abs(lis3dh_accel.z_g);
        printf("temp_acc: %.2f, sustain_count: %d\n", temp_acc, sustain_count);
        nrf_delay_ms(500);

        if(1.85 >= temp_acc && temp_acc >= 1.65){
        //if (temp_acc >= 1.65){
            sustain_count++;
        }
        else
        {
            sustain_count = 0;
        }
        if (sustain_count >= 6)
        {
            acc_flag = true;
            printf("FLAG is set\n");
            //break;
        }
        if (acc_flag)
        {
            TCA.writePin(TCA_LED_PIN_O, TCA.ON);
            TCA.writePin(TCA_LED_PIN_O2, TCA.ON);
        }
    }
    return STATE_SLEEP;
}
sm_state debug_function()
{
    i2c_wrapper.InitializeI2C();
    TCATest();
    nrf_delay_ms(500);
    //print_temperature_sensor_data();
    print_pressure_sensor_data();
    //airplane_mode();
    
//    advTime = 2 * 1000;
//    start_timer(advTime);
//    while (!timerFlag)
//    {
//        // nrf_pwr_mgmt_run();
//    }
//    stop_timer();
    i2c_wrapper.DeInitializeI2C();
    return STATE_SLEEP;
}

void sleep()
{
    if(celltxrx !=0){
    nrf_delay_ms(200);
    nbiot_instance.UnInitialize();
    }
    else{
    app_uart_flush();
    app_uart_close();
    }

    // Clear Pending Interrupts
    NVIC_ClearPendingIRQ(FPU_IRQn);
    NVIC_ClearPendingIRQ(SAADC_IRQn);
    NVIC_ClearPendingIRQ(TEMP_IRQn);
    NVIC_ClearPendingIRQ(SPIM2_SPIS2_SPI2_IRQn);
    NVIC_ClearPendingIRQ(SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn);
    NVIC_ClearPendingIRQ(RADIO_IRQn);
    NVIC_ClearPendingIRQ(UARTE0_UART0_IRQn);
    NVIC_ClearPendingIRQ(TIMER0_IRQn);
    NVIC_ClearPendingIRQ(TIMER1_IRQn);
    NVIC_ClearPendingIRQ(TIMER2_IRQn);

    // Errata
    *(volatile uint32_t *)0x4007AC84ul = 0x00000002ul;
    NVIC_ClearPendingIRQ(GPIOTE_IRQn);

    nrf_delay_ms(200);
    nrf_gpio_pin_clear(CELL_ENABLE_PIN_O);
    nrf_gpio_pin_clear(SENSOR_EN);
    nrf_gpio_pin_clear(GPS_BK_EN);
    nrf_gpio_cfg_default(I2C_SCL);
    nrf_gpio_cfg_default(I2C_SDA);
    nrf_gpio_cfg_default(9);
    nrf_gpio_cfg_default(6);
    nrf_gpio_cfg_default(2);
    nrf_gpio_cfg_default(5);
    nrf_gpio_cfg_default(3);
    nrf_gpio_cfg_default(4);
    nrf_gpio_cfg_default(29);
    nrf_gpio_cfg_default(6);
    nrf_gpio_cfg_default(6);
    nrf_gpio_cfg_default(21);
    nrf_gpio_cfg_default(18);
    nrf_gpio_cfg_default(16);
    nrf_gpio_cfg_default(15);
    nrf_gpio_cfg_default(14);
    nrf_gpio_cfg_default(10);
    nrf_gpio_cfg_default(20);
    nrf_gpio_cfg_default(13);

    *(volatile uint32_t *)0x40003FFC = 0;
    *(volatile uint32_t *)0x40003FFC;
    *(volatile uint32_t *)0x40003FFC = 1;

    *(volatile uint32_t *)0x40004FFC = 0;
    *(volatile uint32_t *)0x40004FFC;
    *(volatile uint32_t *)0x40004FFC = 1;


    while(1)
    {
       nrf_pwr_mgmt_run(); 
    }

