ananawaretrk/Opal_Fcc_nrf52810/fcc_opal_1/main.cpp
}

void TCAEventHandler(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t action) {
  printf("TCA Interrupt detected\n");
  tca_interrupt_detected = true;
}

void TCAInitialize(void) {
  TCA.begin();
  nrf_delay_ms(100);

  TCA.setPin(TCA_GPS_STNDBY_PIN_O, TCA.INPUTa);  // Intentionally setting as input to leave in floating state
  TCA.setPin(TCA_GPS_RST_PIN_O, TCA.INPUTa);
  TCA.setPin(TCA_GPS_EN_PIN_O, TCA.OUTPUTa);
  TCA.setPin(TCA_LED_PIN_O, TCA.OUTPUTa);
  TCA.writePin(TCA_LED_PIN_O, TCA.OFF);
  TCA.setPin(TCA_UNUSED_P11, TCA.OUTPUTa);
  TCA.setPin(TCA_LED_PIN_O2, TCA.OUTPUTa);

  TCA.setPin(TCA_MCP_OCAL, TCA.INPUTa);
  TCA.setPin(TCA_MCP_SCAL, TCA.INPUTa);

  TCA.setPin(TCA_HDCINT_PIN_I, TCA.INPUTa);
  TCA.setPin(TCA_OPT_INT_I, TCA.INPUTa);    
  TCA.setPin(TCA_DPSINT_PIN_I, TCA.INPUTa);
  
  TCA.setPin(TCA_LIS_INT2_I, TCA.INPUTa);
  TCA.writePin(TCA_GPS_EN_PIN_O, TCA.OFF);
  
    TCA.setPin(TCA_BATT_ENABLE_PIN_O, TCA.OUTPUTa);
    TCA.setPin(TCA_LED_PIN_O1, TCA.OUTPUTa);
    TCA.writePin(TCA_LED_PIN_O1, TCA.OFF);
    TCA.setPin(TCA_MCP_EN2_O, TCA.INPUTa);

   
  nrfx_gpiote_in_config_t config_expander;
  config_expander.is_watcher = false;
  config_expander.hi_accuracy = false;
  config_expander.skip_gpio_setup = false;
  config_expander.pull = NRF_GPIO_PIN_NOPULL;
  config_expander.sense = NRF_GPIOTE_POLARITY_HITOLO;
  if(nrfx_gpiote_in_init(MBN_INT, &config_expander, TCAEventHandler) != NRFX_SUCCESS)
    printf("gpiote in init failed for TCA\n");
  nrfx_gpiote_in_event_enable(MBN_INT, true);
  nrf_delay_ms(50);
}

void TCATest(){
  //i2c_wrapper.InitializeI2C();
  //TCAInitialize(); 
  // Pin 14 on TCA is gpio pin 12
  TCA.setPin(12, TCA.OUTPUTa);
  TCA.writePin(TCA_LED_PIN_O, TCA.ON);
    TCA.writePin(TCA_LED_PIN_O2, TCA.ON);
    //while(1);
  for(int i = 0; i < 10; i++){
  //while(1){
    TCA.writePin(TCA_LED_PIN_O, TCA.ON);
    TCA.writePin(TCA_LED_PIN_O2, TCA.ON);
    nrf_delay_ms(200);
    TCA.writePin(TCA_LED_PIN_O, TCA.OFF);
    TCA.writePin(TCA_LED_PIN_O2, TCA.OFF);
    nrf_delay_ms(200);
  }
  //i2c_wrapper.DeInitializeI2C();
}

int main(void) 
{
    ret_code_t err_code;

    state = STATE_SOC_INIT;

    while (1)
    {
        switch (state)
        {
            case STATE_SOC_INIT:
                printf("STATE_SOC_INIT\n");
                state = soc_init();
                break;

            case STATE_BOARD_INIT:
                printf("STATE_BOARD_INIT\n");
                state = board_init();
                break;

            case STATE_GATT_SERVER:
                printf("STATE_GATT_SERVER\n");
                state = start_gatt_server();
                break;

            case STATE_SLEEP:
                printf("STATE_SLEEP\n");
                sleep();
                break;

            case STATE_BLE_CONT_CW_TX:
                printf("STATE_BLE_CONT_CW_TX\n");
                state = ble_cont_cw_tx();
                break;

            case STATE_BLE_CONT_MCW_TX:
                printf("STATE_BLE_CONT_MCW_TX\n");
                state = ble_cont_mcw_tx();
                break;

            case STATE_BLE_CONT_RX:
                printf("STATE_BLE_CONT_RX\n");
                state = ble_cont_rx();
                break;

            case STATE_BLE_INT_CW_TX:
                printf("STATE_BLE_INT_CW_TX\n");
                state = ble_int_cw_tx();
                break;

            case STATE_BLE_INT_MCW_TX:
                printf("STATE_BLE_INT_MCW_TX\n");
                state = ble_int_mcw_tx();
                break;

            case STATE_BLE_INT_RX:
                printf("STATE_BLE_INT_RX\n");
                state = ble_int_rx();
                break;

            case STATE_BLE_INT_CW_TX_RX:
                printf("STATE_BLE_INT_CW_TX_RX\n");
                state = ble_int_cw_tx_rx();
                break;

            case STATE_BLE_INT_MCW_TX_RX:
                printf("STATE_BLE_INT_MCW_TX_RX\n");
                state = ble_int_mcw_tx_rx();
                break;

            case STATE_LTE_CONT_CW_TX:
                printf("STATE_LTE_CONT_CW_TX\n");
                state = lte_cont_cw_tx();
                break;

            case STATE_LTE_CONT_MCW_TX:
                printf("STATE_LTE_CONT_MCW_TX\n");
                state = lte_cont_mcw_tx();
                break;

            case STATE_LTE_CONT_RX:
                printf("STATE_LTE_CONT_RX\n");
                state = lte_cont_rx();
                break;

            case STATE_LTE_INT_CW_TX:
                printf("STATE_LTE_INT_CW_TX\n");
                state = lte_int_cw_tx();
                break;

            case STATE_LTE_INT_MCW_TX:
                printf("STATE_LTE_INT_MCW_TX\n");
                state = lte_int_mcw_tx();
                break;

            case STATE_LTE_INT_RX:
                printf("STATE_LTE_INT_RX\n");
                state = lte_int_rx();
                break;

            /*
            case STATE_DEBUG:
                printf("STATE_DEBUG\n");
                state = debug_function();
                break;
            
            case STATE_ACCELERATION_AIRPLANE_MODE:
                 printf("STATE_ACCELERATION_AIRPLANE_MODE\n");
                 state = acceleration_airplane_mode();
                 break;

             case STATE_PRESSURE_AIRPLANE_MODE:
                 printf("STATE_PRESSURE_AIRPLANE_MODE\n");
                 state = pressure_airplane_mode();
                 break;
             */
             case STATE_MODEM_NETWORK_CONFIG:
                  printf("STATE_MODEM_NETWORK_CONFIG");
                  state = modem_network_config();
                  break;

            default:
                printf("DEFAULT: STATE_SLEEP\n");
                sleep();
                break;
        }
    }
}

/*
Battery Level, 50% battery voltage on pin PO_29/AIN5
4.3V-2.75V/2 = 2.15V-1.355V/6 = 0.358-0.22V     1024=0.6V, 0=0V
*/
int checkBit(int n)
{
    return ((TapeLog[1].scanLog[0].counter >> n) & 1);
}
void clearBit(int n)
{
    if(checkBit(n) == 1)
    {
        TapeLog[1].scanLog[0].counter &= ~(1 << n);
        TapeLog[0].scanLog[n].millisTime = (millis() - millis_init)/1000;
    }
    TapeLog[0].scanLog[n].counter = 0;
}

void setBit(int n)
{
    if(checkBit(n) == 0)
    {
        TapeLog[1].scanLog[0].counter |= 1 << n;
        TapeLog[0].scanLog[n].millisTime = (millis() - millis_init)/1000;
    }
    TapeLog[0].scanLog[n].counter = 0;
}

void wdt_init(int seconds)
{
    NRF_WDT->CONFIG = (WDT_CONFIG_HALT_Pause << WDT_CONFIG_HALT_Pos) | (WDT_CONFIG_SLEEP_Run << WDT_CONFIG_SLEEP_Pos); //Configure Watchdog. a) Pause watchdog while the CPU is halted by the debugger.    b) Keep the watchdog running while the CPU is sleeping.
    NRF_WDT->CRV = seconds * 32768;                                                                                                                                                                        //ca 3 sek. timout
    NRF_WDT->RREN |= WDT_RREN_RR0_Msk;                                                                                                                                                                 //Enable reload register 0

    // Enable WDT interrupt:
    NVIC_EnableIRQ(WDT_IRQn);
    NRF_WDT->INTENSET = WDT_INTENSET_TIMEOUT_Msk;

    NRF_WDT->TASKS_START = 1; //Start the Watchdog timer
}

void wdt_reset()
{
    NRF_WDT->RR[0] = WDT_RR_RR_Reload;
}

bool checkZeros(void)
{
    for(int i=1;i<=(data_len-11);i++)
    {
        if(adv_data[adv_len-i] != 0)
        {
            return false;
        }
    }
    return true;
}

void zeroTags(int tagy)
{
    records = 0;
    millis_init = 0;
    memset(m_beacon_info,0,sizeof(m_beacon_info));
    TapeLog[1].scanLog[0].millisTime = 0;
    TapeLog[1].scanLog[0].counter = 0;
    clearFlag = true;

    for (int k = 0; k < NUMBER_OF_TAGS; k++)
    {
        TapeLog[tagy].scanLog[k].subID = 0;
        TapeLog[tagy].scanLog[k].tempRec = 0;
        TapeLog[tagy].scanLog[k].Lorarssi = 0;
        TapeLog[tagy].scanLog[k].subBat = 0;
        TapeLog[tagy].scanLog[k].millisTime = 0;
        TapeLog[tagy].scanLog[k].counter = 0;
        memset(TapeLog[tagy].scanLog[k].addr, 0, MAX_ID_BUF_LENGTH);

        TapeLog[tagy].glat = -1;
        TapeLog[tagy].glon = -1;
        TapeLog[tagy].logNo = 0;
        TapeLog[tagy].relayBat = 0;
        memset(TapeLog[tagy].relayId, 0, MAX_ID_BUF_LENGTH);
    }
}

int checkIdInLog(uint8_t inArray[], int testlog)
{
    for (int k = 0; k < NUMBER_OF_TAGS; k++)
    {
        if (compareArrays(inArray, TapeLog[testlog].scanLog[k].addr, 6))
        {
            return k;
        }
    }
    return -1;
}

int compareArrays(uint8_t a[], uint8_t b[], int n)
{
    for (int ii = 0; ii < n; ii++)
    {
        if (a[ii] != b[ii])
        {
            return 0;
        }
    }

    return 1;
}

